[
    {
      "id": 1,
      "title": "Oil Change",
      "description": "Regular oil changes are essential for maintaining your vehicle's engine health and prolonging its lifespan.",
      "detailedDescription": [
        "Typically, you should change your oil every 7,000 to 10,000 kilometers or every 6 months.",
        "Select the appropriate type and viscosity of motor oil based on your vehicle's specifications and the climate in your region.",
        "0w-20, 5w-20, 5w-30 are the most common oil viscosities from thinnest to thickest."
      ],
      "icon": "engine-oil.png"
    },
    {
      "id": 2,
      "title": "Check Engine Light",
      "description": "The check engine light, also known as the malfunction indicator light (MIL), indicates that the vehicle's onboard computer has detected a problem with the engine, emissions, or other related systems. It's recommended to use a diagnostic trouble code (DTC) scanner to retrieve the specific error code.",
      "detailedDescription": [
        "If you do not have a DTC scanner, you can usually go by an auto shop or dealership to get it scanned for free.",
        "Scanning DTC lights should always be free of charge, so if they try to make you pay, deny it and find another auto shop or dealership to go to!"
      ],
      "icon": "diagnostic-tool.png"
    },
    {
      "id": 3,
      "title": "Tires",
      "description": "Maintaining your vehicle's tires is essential for safety and performance. Here are some DIY tire maintenance tips:",
      "detailedDescription": [
        "Depending on driving conditions, you should rotate your tires roughly every 8,000 to 15,000 kilometers.",
        "If your steering wheel is shaking, especially at high speeds like on the highway, you most likely need a wheel balance.",
        "Check your tire pressures regularly. Most vehicles have recommended tire pressures between 32-36 PSI.",
        "There is a sticker/placard that shows your specific vehicle's recommended tire pressure, typically located on the driver's side door jam."
      ],
      "icon": "wheel.png"
    },
    {
      "id": 4,
      "title": "Brake Pads",
      "description": "Regularly inspecting your brakes and addressing issues promptly helps maintain safe braking performance.",
      "detailedDescription": [
        "Periodically check brake pad thickness. If they are worn down to around 1/8 inch or less, it's time to replace them.",
        "If you're driving and you feel vibration whenever you brake, you most likely have a warped disc rotor and need that machined or replaced.",
        "Consider having a professional perform a brake fluid flush every 2 years or as recommended in your vehicle's manual for optimal brake performance."
      ],
      "icon": "brake-disc.png"
    },
    {
      "id": 5,
      "title": "Engine Air Filter",
      "description": "Regularly replacing the Engine Air Filter is essential for a healthy engine.",
      "detailedDescription": [
        "Check and replace the engine air filter according to your vehicle's recommended maintenance schedule. A clean air filter ensures optimal engine performance and fuel efficiency.",
        "The engine air filter is usually located in a rectangular or cylindrical air filter box under the hood of your car.",
        "In most vehicles, it's easily accessible by unclipping or unscrewing the air filter box cover."
      ],
      "icon": "air-filter.png"
    },
    {
      "id": 6,
      "title": "Cabin Air Filter",
      "description": "Regularly replacing the Cabin Air Filter is essential for a healthy and comfortable cabin environment.",
      "detailedDescription": [
        "The cabin air filter is usually located behind the glove compartment or under the dashboard on the passenger side of the vehicle.",
        "Note: Nissans usually have their cabin air filters under the dashboard on the passenger's side and sometimes under the driver's side.",
        "Some vehicles may have the cabin air filter in the engine bay, near the windshield wipers.",
        "Access to the cabin air filter may require removing the glove compartment or a cover panel.",
        "Please note that the exact location can vary depending on the make and model of your vehicle. Refer to your vehicle's owner's manual for specific instructions on accessing and replacing these filters."
      ],
      "icon": "cabin-filter.png"
    },
    {
      "id": 7,
      "title": "Battery",
      "description": "",
      "detailedDescription": [
        "Inspect the battery terminals for corrosion and clean them if necessary.",
        "Check the battery's fluid level (for non-maintenance-free batteries) and top it off with distilled water if needed.",
        "Consider having the battery tested to ensure it's holding a charge effectively."
      ],
      "icon": "battery.png"
    },
    {
      "id": 8,
      "title": "Coolant",
      "description": "",
      "detailedDescription": [
        "Regularly check the coolant level in the overflow tank when the engine is cool.",
        "Top off the coolant with a 50/50 mix of coolant and water if it's low.",
        "Inspect hoses and connections for coolant leaks and repair as needed."
      ],
      "icon": "coolant.png"
    },
    {
      "id": 9,
      "title": "Transmission",
      "description": "",
      "detailedDescription": [
        "Check the transmission fluid level according to your vehicle's recommended maintenance schedule.",
        "Replace the transmission fluid and filter as recommended by the manufacturer.",
        "Inspect for transmission fluid leaks and repair as needed."
      ],
      "icon": "gearshift.png"
    },
    {
      "id": 10,
      "title": "Lights",
      "description": "",
      "detailedDescription": [
        "Regularly check all exterior and interior lights, including headlights, taillights, turn signals, brake lights, and interior bulbs.",
        "Replace any burned-out bulbs promptly to ensure visibility and safety."
      ],
      "icon": "headlight.png"
    },
    {
      "id": 11,
      "title": "Serpentine Belt",
      "description": "",
      "detailedDescription": [
        "Inspect the serpentine belt for signs of wear, such as cracks, fraying, or glazing.",
        "Replace the serpentine belt as recommended by the manufacturer or if you notice any damage."
      ],
      "icon": "belt.png"
    },
    {
      "id": 12,
      "title": "Tire Pressure",
      "description": "",
      "detailedDescription": [
        "Regularly check and maintain the correct tire pressure as indicated in your vehicle's owner's manual or on the driver's side door jam sticker.",
        "Proper tire pressure ensures safety, even tire wear, and optimal fuel efficiency."
      ],
      "icon": "tire-pressure.png"
    },
    {
      "id": 13,
      "title": "Windshield Wipers",
      "description": "",
      "detailedDescription": [
        "Inspect windshield wiper blades for signs of wear or damage, such as streaking or skipping.",
        "Replace windshield wiper blades as needed for clear visibility during rainy or snowy conditions."
      ],
      "icon": "wiper.png"
    },
    {
      "id": 14,
      "title": "Spark Plugs",
      "description": "",
      "detailedDescription": [
        "Check and replace spark plugs according to your vehicle's recommended maintenance schedule.",
        "Worn or fouled spark plugs can lead to poor engine performance and reduced fuel efficiency."
      ],
      "icon": "spark-plug.png"
    }
  ]
  